package com.ling.utils;

import cn.hutool.core.util.RandomUtil;

import java.util.HashMap;
import java.util.Map;

public class AddresUtils {

    public static String generateRandomAddress() {
        // 随机生成省
        String province = RandomUtil.randomEle(Provinces.PROVINCES);

        // 随机生成市
        String city = RandomUtil.randomEle(Cities.CITIES.get(province));

        // 随机生成区
        String district = RandomUtil.randomEle(Districts.DISTRICTS.get(city));

        // 组合地址
        return province + city + district;
    }

    // 省份列表
    private static class Provinces {
        private static final String[] PROVINCES = {
                "北京市", "天津市", "河北省", "山西省", "内蒙古自治区"
        };
    }

    // 城市列表
    private static class Cities {
        private static final Map<String, String[]> CITIES = new HashMap<>();

        static {
            CITIES.put("北京市", new String[]{"北京市"});
            CITIES.put("天津市", new String[]{"天津市"});
            CITIES.put("河北省", new String[]{"石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"});
            CITIES.put("山西省", new String[]{"太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"});
            CITIES.put("内蒙古自治区", new String[]{"呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"});

        }
    }

    // 区县列表
    private static class Districts {
        private static final Map<String, String[]> DISTRICTS = new HashMap<>();

        static {
            DISTRICTS.put("北京市", new String[]{"东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"});
            DISTRICTS.put("天津市", new String[]{"和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "滨海新区", "宁河区", "静海区", "蓟州区"});
            DISTRICTS.put("石家庄市", new String[]{"长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市"});
            DISTRICTS.put("唐山市", new String[]{"路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "曹妃甸区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县", "遵化市", "迁安市"});
            DISTRICTS.put("秦皇岛市", new String[]{"海港区", "山海关区", "北戴河区", "青龙满族自治县", "昌黎县", "抚宁县", "卢龙县"});
            DISTRICTS.put("邯郸市", new String[]{"邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市"});
            DISTRICTS.put("邢台市", new String[]{"桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市"});
            DISTRICTS.put("保定市", new String[]{"新市区", "北市区", "南市区", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市"});
            DISTRICTS.put("张家口市", new String[]{"桥东区", "桥西区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"});
            DISTRICTS.put("承德市", new String[]{"双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"});
            DISTRICTS.put("沧州市", new String[]{"新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市"});
            DISTRICTS.put("廊坊市", new String[]{"安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市"});
            DISTRICTS.put("衡水市", new String[]{"桃城区", "冀州市", "深州市", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县"});
            DISTRICTS.put("太原市", new String[]{"小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"});
            DISTRICTS.put("大同市", new String[]{"城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"});
            DISTRICTS.put("阳泉市", new String[]{"城区", "矿区", "郊区", "平定县", "盂县"});
            DISTRICTS.put("长治市", new String[]{"城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市"});
            DISTRICTS.put("晋城市", new String[]{"城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"});
            DISTRICTS.put("朔州市", new String[]{"朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"});
            DISTRICTS.put("晋中市", new String[]{"榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市"});
            DISTRICTS.put("运城市", new String[]{"盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"});
            DISTRICTS.put("忻州市", new String[]{"忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市"});
            DISTRICTS.put("临汾市", new String[]{"尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市 ", "霍州市"});
            DISTRICTS.put("吕梁市", new String[]{"离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"});
            DISTRICTS.put("呼和浩特市", new String[]{"新城区", "回民区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"});
            DISTRICTS.put("包头市", new String[]{"东河区", "昆都仑区", "青山区", "石拐区", "白云鄂博矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"});
            DISTRICTS.put("乌海市", new String[]{"海勃湾区", "海南区", "乌达区"});
            DISTRICTS.put("赤峰市", new String[]{"红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"});
            DISTRICTS.put("通辽市", new String[]{"科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒市"});
            DISTRICTS.put("鄂尔多斯市", new String[]{"东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"});
            DISTRICTS.put("呼伦贝尔市", new String[]{"海拉尔区", "扎赉诺尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市 ", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市"});
            DISTRICTS.put("巴彦淖尔市", new String[]{"临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"});
            DISTRICTS.put("乌兰察布市", new String[]{"集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"});
            DISTRICTS.put("兴安盟", new String[]{"乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"});
            DISTRICTS.put("锡林郭勒盟", new String[]{"二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗 ", "多伦县"});
            DISTRICTS.put("阿拉善盟", new String[]{"阿拉善左旗", "阿拉善右旗", "额济纳旗"});
        }

    }
}
